Revit 2027 API
PathOfTravelCalculationServerIds Class
 Ids for external servers implementing path of travel calculations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PathOfTravelCalculationServerIds
Public NotInheritable Class PathOfTravelCalculationServerIds
public ref class PathOfTravelCalculationServerIds abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PathOfTravelCalculationServerIds = class end
The PathOfTravelCalculationServerIds type exposes the following members.
Properties
Name | Description
DefaultPathOfTravelCalculationGUID |  GUID to represent the default calculation server id.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace